## Введение в указатели

Указатели — это переменные, которые хранят адрес другой переменной. Указатели позволяют работать с памятью на низком уровне и управлять данными напрямую.
По сути, память в компьютере устроена так же, как массив, который мы уже рассматривали. У каждой ячейки памяти есть свой адрес, и если мы знаем этот адрес, то всегда можем получить доступ к данным, которые в ней хранятся.
Работа с указателями требует особой осторожности и внимательности. **Я настоятельно рекомендую изучить устройство памяти компьютера, чтобы лучше понять, как это работает. Сколько занимает памяти каждый из основных типов данных.**

Указатель хранит адрес в памяти где хранится другая переменная. Для получения адреса переменной используется оператор `&`. Для доступа к значению, хранящемуся по адресу, используется оператор разыменования `*`.

**Синтаксис:**
```cpp
тип_данных *имя_указателя;
```

Указатель имеет такой же `тип_данных`, как переменная, на которую он указывает.
По `*` возле `имя_указателя` вы всегда поймете, что это указатель.

**Пример:**
```cpp
#include <iostream>

int main() {
    int x = 10;
    int *ptr = &x; // Указатель ptr хранит адрес переменной x
    
        std::cout << "Значение x: " << x << std::endl;
        std::cout << "Адрес x: " << &x << std::endl;
        std::cout << "Указатель ptr: " << ptr << std::endl;
        std::cout << "Значение через указатель ptr: " << *ptr << std::endl; // Разыменование
        return 0;
}
```

**Внимание!** Если вы объявляете указатель, но не задаете ему значение, обязательно используйте `nullptr`, например: `int *ptr = nullptr;`. Это создаст так называемый пустой указатель. Принцип работы здесь аналогичен обычным переменным.

В следующих темах станет понятнее, почему указатель удобно использовать

### Задача
Напишите программу, которая: Создаёт указатель на целое число. Присваивает значение через указатель. Выводит значение и адрес.