## Операции с указателями

### Указатели и массивы

**Массивы как указатели**

В C++ массивы и указатели тесно связаны. Имя массива `(arr)` является указателем на первый элемент массива.

**Пример:**
```cpp
#include <iostream>

int main() {
    int arr[5] = {10, 20, 30, 40, 50};
    int *ptr = arr; // Указатель на первый элемент массива
    
        std::cout << "Первый элемент массива: " << *ptr << std::endl;   // Разыменование указателя
        std::cout << "Второй элемент массива: " << *(ptr + 1) << std::endl; // Арифметика указателей
    
        return 0;
}
```
`arr`: Указатель на первый элемент массива.

`*(ptr + 1)`: Доступ ко второму элементу массива.

**Перебор массива с помощью указателя**

Указатель можно использовать для перебора элементов массива с помощью арифметики указателей.

**Пример:**
```cpp
#include <iostream>

int main() {
    int arr[5] = {10, 20, 30, 40, 50};
    int *ptr = arr;
    
        for (int i = 0; i < 5; i++) {
            std::cout << "Элемент " << i << ": " << *(ptr + i) << std::endl;
        }
    
    return 0;
}
```

### Указатели и функции

Указатели можно использовать для передачи данных в функции. Это позволяет изменять исходные данные, передавая их адреса.
Это один из примеров, когда указатель оказывается очень удобным. Вместо копирования значения, вы передаете его адрес, что позволяет изменять объект, находящийся вне области видимости функции.

**Передача указателя в функцию**

Функция может принимать указатель на переменную, чтобы работать с её значением напрямую.

**Пример:**
```cpp
#include <iostream>

void changeValue(int *ptr) {
    *ptr = 100; // Изменяем значение через указатель
}

int main() {
    int num = 10;
    std::cout << "До изменения: " << num << std::endl;
    
        changeValue(&num); // Передаём адрес переменной
        std::cout << "После изменения: " << num << std::endl;
    
        return 0;
}
```

`int *ptr`: Указатель в качестве параметра функции.
`changeValue(&num)`: Передаём адрес переменной.

**Передача массива в функцию**

Массивы передаются в функции как указатели. Фактически, в функцию передаётся адрес первого элемента массива. Вместо того, чтобы копировать весь массив. То есть, мы экономим память программы. Это очень важно учитывать, чтобы создавать эффективные решения.

**Пример:**
```cpp
#include <iostream>

void printArray(int *arr, int size) {
    for (int i = 0; i < size; i++) {
        std::cout << "Элемент " << i << ": " << *(arr + i) << std::endl;
    }
}

int main() {
    int arr[5] = {10, 20, 30, 40, 50};
    printArray(arr, 5); // Передаём массив в функцию
    
    return 0;
}
```
`int *arr`: Указатель на массив.
`*(arr + i)`: Доступ к элементу массива через арифметику указателей.

**Возврат указателя из функции**

Это мы подробнее рассмотрим в теме динамического выделения памяти. По сути, функция может возвращать не просто переменную, а указатель — аналогично тому, как мы обсуждали в теме функций.

## Задача

Напишите программу, которая: 
Создаёт массив целых чисел из 10 элементов и заполняет его случайными числами от 1 до 100. 
Использует указатель для перебора элементов массива и их вывода.
Реализует функцию, которая принимает указатель на массив и его размер, и возвращает указатель на максимальный элемент массива.
Реализует функцию, которая изменяет значение элемента массива, переданного через указатель.